<p class='text'>
    PHP (англ. PHP: Hypertext Preprocessor — PHP: гіпертекстовий препроцесор), попередня назва: Personal Home Page Tools — скриптова мова програмування, була створена для генерації HTML-сторінок на стороні веб-сервера. PHP є однією з найпоширеніших мов, що використовуються у сфері веб-розробок (разом із Java, .NET, Perl, Python, Ruby). PHP підтримується переважною більшістю хостинг-провайдерів. PHP — проект відкритого програмного забезпечення.
</p>
<p class='text'>
    PHP інтерпретується веб-сервером у HTML-код, який передається на сторону клієнта. На відміну від скриптової мови JavaScript, користувач не бачить PHP-коду, бо браузер отримує готовий html-код. Це є перевага з точки зору безпеки, але погіршує інтерактивність сторінок. Але ніхто не забороняє використовувати PHP для генерування JavaScript-кодів, які виконуються вже на стороні клієнта.
</p>
<p class='text'>
    PHP — мова, код якої можна вбудовувати безпосередньо html-код сторінок, які у свою чергу, будуть коректно оброблені PHP-інтерпретатором. Обробник РНР просто починає виконувати код після відкриваючого тегу (< ?php) і продовжує виконання до того моменту, поки не зустріне закриваючий тег (?>).
</p>