<?php
$button = array( //кнопкі
                array('eng' => 'анг', 'ukr' => 'укр', 'add' => 'Добавити новину', 'new' => '&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Новини &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;', 'reg' => 'Реєстрація', 'hom' => 'Головна', 'con' => '&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Профіль &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;', 'exit' => 'Вийти', 'dc' => 'Дата створення', 'ed' => 'Редагувати', 'edpr' => 'Редагувати профіль', 'adm'=>'&nbsp;&nbsp;&nbsp;Адміністратор&nbsp;&nbsp;'),
                //перевірка реєстрації
                array('lo' => 'Цей логін вже використовується', 'mel' => 'Такий імейл вже існує', 'pas' => 'Невірний пароль', 'mal' => 'Неправильна адреса електронної пошти', 'avavv' =>'Заповніть форму аватарки!'),
                //форма реєстрації і форма додавання
                array('ent' => 'Введіть логін', 'pass' => 'Введіть пароль', 'pass2' => 'Повторно введіть пароль', 'em' => 'Введіть електронну пошту', 'av' => 'Оновити світлину', 'nm' => "Введіть своє ім'я", 'zag' => 'Заголовок новин', 'tex' => 'Текст новин', 'pic' => 'зображення', 'dge' => 'джерело', 'dob' => 'Добавити', 'lagin' => 'Неправильний логін або пароль', 'login' => 'Логін', 'password' => 'Пароль', 'exit' => 'Вхід', 'commentary' => 'Добавити коментар', 'send' => 'Відправити'),
                //Помилкі редагування профілю
                array('pos' => 'Помилка поточного пароля', 'pos1' => 'Ви пропустили поле пароля', 'erro' => 'Доступ заборонено'),
                //вивід новин
                array('aut' => 'Автор Новини:', 'du' => 'Дата оновлення', 'sour' => 'Джерело'),
                );